"""
Сопоставление распознанных стилей музыки со стилями, заданными в файле `radio_links.yaml`
"""
music_style_names = {
  'транс': 'TRANCE',
  'хаус': 'HOUSE',
  'хауз': 'HOUSE',

  'диско': 'DISCO',
  'данс': 'DANCE',
  'дэнс': 'DANCE',

  'рок': 'ROCK',
  'джаз': 'JAZZ',
  'поп': 'POP',

  'сон': 'SLEEP',

  'солдаты': 'ARMY',
  'дети': 'CHILD',
  'акустика': 'ACOUSTIC',
  'мурзилки': 'MURZILKI',
  'юмор': 'HUMOR',

  'высокое': 'HI',
  'возвышенное': 'HI',
  'дорога': 'ROAD',

  'синтипоп': 'SYNTH',
  'синти': 'SYNTH',

  'мечтательное': 'DREAM',
  'мечта': 'DREAM',

  'рождество': 'CHRISTMAS',
  'новый год': 'CHRISTMAS',

  'клавиши': 'PIANO',
  'драм': 'DNB',
  
  'авторская песня': 'AUTHOR',
  'авторская': 'AUTHOR',
  'авторское': 'AUTHOR',
  'барды': 'AUTHOR',

  'шансон': 'SHANSON',

  'разное': '*',
}
